{
  "_name_or_path": "nickmuchi/sec-bert-finetuned-finance-classification",
  "adapters": {
    "adapters": {
      "nickmuchi/sec-bert-finetuned-finance-classification_adapter": "7ee253f8cb7be91f"
    },
    "config_map": {
      "7ee253f8cb7be91f": {
        "architecture": "union",
        "configs": [
          {
            "architecture": "prefix_tuning",
            "bottleneck_size": 512,
            "cross_prefix": true,
            "dropout": 0.0,
            "encoder_prefix": true,
            "flat": false,
            "leave_out": [],
            "non_linearity": "tanh",
            "prefix_length": 10,
            "shared_gating": true,
            "use_gating": true
          },
          {
            "adapter_residual_before_ln": false,
            "cross_adapter": false,
            "factorized_phm_W": true,
            "factorized_phm_rule": false,
            "hypercomplex_nonlinearity": "glorot-uniform",
            "init_weights": "bert",
            "inv_adapter": null,
            "inv_adapter_reduction_factor": null,
            "is_parallel": false,
            "learn_phm": true,
            "leave_out": [],
            "ln_after": false,
            "ln_before": false,
            "mh_adapter": false,
            "non_linearity": "relu",
            "original_ln_after": true,
            "original_ln_before": true,
            "output_adapter": true,
            "phm_bias": true,
            "phm_c_init": "normal",
            "phm_dim": 4,
            "phm_init_range": 0.0001,
            "phm_layer": false,
            "phm_rank": 1,
            "reduction_factor": 16,
            "residual_before_ln": true,
            "scaling": 1.0,
            "shared_W_phm": false,
            "shared_phm_rule": true,
            "use_gating": true
          },
          {
            "alpha": 8,
            "architecture": "lora",
            "attn_matrices": [
              "q",
              "v"
            ],
            "composition_mode": "add",
            "dropout": 0.0,
            "init_weights": "lora",
            "intermediate_lora": false,
            "leave_out": [],
            "output_lora": false,
            "r": 8,
            "selfattn_lora": true,
            "use_gating": true
          }
        ]
      }
    },
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "bearish",
    "1": "neutral",
    "2": "bullish"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "bearish": 0,
    "bullish": 2,
    "neutral": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
