{
  "_name_or_path": "yiyanghkust/finbert-tone",
  "adapters": {
    "adapters": {
      "yiyanghkust/finbert-tone_adapter": "97453c0dbc2dbc97"
    },
    "config_map": {
      "97453c0dbc2dbc97": {
        "architecture": "union",
        "configs": [
          {
            "architecture": "prefix_tuning",
            "bottleneck_size": 800,
            "cross_prefix": true,
            "dropout": 0.0,
            "encoder_prefix": true,
            "flat": false,
            "leave_out": [],
            "non_linearity": "tanh",
            "prefix_length": 30,
            "shared_gating": true,
            "use_gating": false
          },
          {
            "adapter_residual_before_ln": false,
            "cross_adapter": false,
            "factorized_phm_W": true,
            "factorized_phm_rule": false,
            "hypercomplex_nonlinearity": "glorot-uniform",
            "init_weights": "mam_adapter",
            "inv_adapter": null,
            "inv_adapter_reduction_factor": null,
            "is_parallel": true,
            "learn_phm": true,
            "leave_out": [],
            "ln_after": false,
            "ln_before": false,
            "mh_adapter": false,
            "non_linearity": "relu",
            "original_ln_after": true,
            "original_ln_before": false,
            "output_adapter": true,
            "phm_bias": true,
            "phm_c_init": "normal",
            "phm_dim": 4,
            "phm_init_range": 0.0001,
            "phm_layer": false,
            "phm_rank": 1,
            "reduction_factor": 2,
            "residual_before_ln": true,
            "scaling": 4.0,
            "shared_W_phm": false,
            "shared_phm_rule": true,
            "use_gating": false
          }
        ]
      }
    },
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Neutral",
    "1": "Positive",
    "2": "Negative"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Negative": 2,
    "Neutral": 0,
    "Positive": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30873
}
