{
  "_name_or_path": "kwang123/bert-sentiment-analysis",
  "adapters": {
    "adapters": {
      "kwang123/bert-sentiment-analysis_adapter": "625403edad0bf919"
    },
    "config_map": {
      "625403edad0bf919": {
        "alpha": 8,
        "architecture": "lora",
        "attn_matrices": [
          "q",
          "v"
        ],
        "composition_mode": "add",
        "dropout": 0.0,
        "init_weights": "lora",
        "intermediate_lora": false,
        "leave_out": [],
        "output_lora": false,
        "r": 8,
        "selfattn_lora": true,
        "use_gating": false
      }
    },
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Extremely Negative",
    "1": "Negative",
    "2": "Neutral",
    "3": "Positive",
    "4": "Extremely Positive"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Extremely Negative": 0,
    "Extremely Positive": 4,
    "Negative": 1,
    "Neutral": 2,
    "Positive": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
