{
  "_name_or_path": "distilbert/distilbert-base-uncased-finetuned-sst-2-english",
  "activation": "gelu",
  "adapters": {
    "adapters": {
      "distilbert/distilbert-base-uncased-finetuned-sst-2-english_adapter": "625403edad0bf919"
    },
    "config_map": {
      "625403edad0bf919": {
        "alpha": 8,
        "architecture": "lora",
        "attn_matrices": [
          "q",
          "v"
        ],
        "composition_mode": "add",
        "dropout": 0.0,
        "init_weights": "lora",
        "intermediate_lora": false,
        "leave_out": [],
        "output_lora": false,
        "r": 8,
        "selfattn_lora": true,
        "use_gating": false
      }
    },
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "finetuning_task": "sst-2",
  "hidden_dim": 3072,
  "id2label": {
    "0": "NEGATIVE",
    "1": "POSITIVE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "NEGATIVE": 0,
    "POSITIVE": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "vocab_size": 30522
}
