{
  "_name_or_path": "siebert/sentiment-roberta-large-english",
  "adapters": {
    "adapters": {
      "siebert/sentiment-roberta-large-english_adapter": "625403edad0bf919"
    },
    "config_map": {
      "625403edad0bf919": {
        "alpha": 8,
        "architecture": "lora",
        "attn_matrices": [
          "q",
          "v"
        ],
        "composition_mode": "add",
        "dropout": 0.0,
        "init_weights": "lora",
        "intermediate_lora": false,
        "leave_out": [],
        "output_lora": false,
        "r": 8,
        "selfattn_lora": true,
        "use_gating": false
      }
    },
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "NEGATIVE",
    "1": "POSITIVE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "NEGATIVE": 0,
    "POSITIVE": 1
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
